压力测试/官网对比压测/JMeter脚本/官网-GLM-5.2-流式压测.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="官网 GLM 5.2 流式性能压测">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义变量">
        <collectionProp name="Arguments.arguments">
          <elementProp name="PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">PROTOCOL</stringProp>
            <stringProp name="Argument.value">${__P(protocol,https)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">${__P(host,dashscope.aliyuncs.com)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">${__P(port,443)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="API_KEY" elementType="Argument">
            <stringProp name="Argument.name">API_KEY</stringProp>
            <stringProp name="Argument.value">${__P(apiKey,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="MODEL" elementType="Argument">
            <stringProp name="Argument.name">MODEL</stringProp>
            <stringProp name="Argument.value">${__P(model,glm-5.2)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="STREAM" elementType="Argument">
            <stringProp name="Argument.name">STREAM</stringProp>
            <stringProp name="Argument.value">${__P(stream,false)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ACCEPT" elementType="Argument">
            <stringProp name="Argument.name">ACCEPT</stringProp>
            <stringProp name="Argument.value">${__P(accept,application/json)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <stringProp name="TestPlan.comments">阿里云百炼官网glm-5.2流式对比压测；逐SSE事件校验；非GUI执行。</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP请求默认值">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">300000</stringProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP信息头">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="Authorization" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Bearer ${API_KEY}</stringProp>
          </elementProp>
          <elementProp name="Content-Type" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="Accept" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">${ACCEPT}</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="${__P(stage,T0)}-${__P(threads,1)}线程">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(loops,1)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(threads,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampSeconds,1)}</stringProp>
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="${__P(stage,T0)}-POST-chat-completions-glm-5.2">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义的变量">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  &quot;model&quot;: &quot;${MODEL}&quot;,
  &quot;messages&quot;: [
    {
      &quot;role&quot;: &quot;user&quot;,
      &quot;content&quot;: &quot;给出一套成都旅游一日游方案，50字左右。请求标识：${__UUID()}，请勿在答案中输出请求标识。&quot;
    }
  ],
  &quot;temperature&quot;: 0.2,
  &quot;max_tokens&quot;: 32768,
  &quot;stream&quot;: ${STREAM}
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/compatible-mode/v1/chat/completions</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <boolProp name="HTTPSampler.image_parser">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="断言-HTTP状态码200">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">HTTP状态码不是200</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="断言-业务响应结构">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import groovy.json.JsonSlurper

if (prev.getResponseCode() != '200') {
    return
}

def body = prev.getResponseDataAsString()
def stream = props.getProperty('stream', 'false').toBoolean()
if (stream) {
    def headers = prev.getResponseHeaders() ?: ''
    def dataEvents = body.readLines()
        .collect { it.trim() }
        .findAll { it.startsWith('data:') }
        .collect { it.substring(5).trim() }
        .findAll { it }
    def doneIndexes = dataEvents.withIndex().findAll { item, index -&gt; item == '[DONE]' }.collect { it[1] }
    def hasDone = !doneIndexes.isEmpty()
    def payloads = dataEvents.findAll { it != '[DONE]' }
    def slurper = new JsonSlurper()
    def content = new StringBuilder()
    def reasoning = new StringBuilder()
    def apiErrors = []
    def badEvents = 0
    def choiceEvents = 0

    payloads.each { payload -&gt;
        try {
            def event = slurper.parseText(payload)
            if (event?.error) {
                apiErrors &lt;&lt; (event.error?.message ?: event.error.toString())
            }
            def choices = event?.choices
            if (choices instanceof List &amp;&amp; !choices.isEmpty()) {
                choiceEvents++
                def delta = choices[0]?.delta
                if (delta?.content != null) content.append(delta.content.toString())
                if (delta?.reasoning_content != null) reasoning.append(delta.reasoning_content.toString())
            }
        } catch (Exception ignored) {
            badEvents++
        }
    }

    def errors = []
    if (!(headers =~ /(?i)Content-Type:\s*text\/event-stream/).find()) errors &lt;&lt; 'SSE_CONTENT_TYPE: Content-Type不是text/event-stream'
    if (dataEvents.size() &lt; 2) errors &lt;&lt; "SSE_NO_EVENTS: SSE事件数=${dataEvents.size()}"
    if (!hasDone) errors &lt;&lt; 'SSE_INCOMPLETE: 未收到逐行精确匹配的[DONE]'
    if (doneIndexes.size() &gt; 1) errors &lt;&lt; "SSE_DUPLICATE_DONE: [DONE]数量=${doneIndexes.size()}"
    if (hasDone &amp;&amp; doneIndexes[0] != dataEvents.size() - 1) errors &lt;&lt; 'SSE_DONE_NOT_LAST: [DONE]不是最后一个data事件'
    if (choiceEvents == 0) errors &lt;&lt; 'SSE_NO_CHOICES: 未收到choices事件'
    if (content.toString().trim().isEmpty()) errors &lt;&lt; "SSE_EMPTY_CONTENT: 正文为空，reasoning字符数=${reasoning.length()}"
    if (badEvents &gt; 0) errors &lt;&lt; "SSE_INVALID_JSON: 非法JSON事件数=${badEvents}"
    if (!apiErrors.isEmpty()) errors &lt;&lt; ('SSE_BUSINESS_ERROR: ' + apiErrors.take(1).join(''))

    if (!errors.isEmpty()) {
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage(errors.join('; '))
    }
} else {
    try {
        def json = new JsonSlurper().parseText(body)
        if (json instanceof Map &amp;&amp; json.error) {
            AssertionResult.setFailure(true)
            AssertionResult.setFailureMessage('BUSINESS_ERROR: ' + json.error.toString())
            return
        }
        def content = json?.choices?.getAt(0)?.message?.content?.toString()?.trim()
        if (!content) {
            AssertionResult.setFailure(true)
            AssertionResult.setFailureMessage('EMPTY_CONTENT: choices[0].message.content为空')
        }
    } catch (Exception ex) {
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage('INVALID_JSON: ' + ex.getMessage())
    }
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="预检-仅保存第一份完整响应">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def previewPath = props.getProperty('previewFile', '')
if (previewPath &amp;&amp; !new File(previewPath).exists()) {
    synchronized (this.class) {
        def target = new File(previewPath)
        if (!target.exists()) {
            target.parentFile?.mkdirs()
            target.setText(prev.getResponseDataAsString(), 'UTF-8')
        }
    }
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>